Revit 2027 API
DrawContext Methods
The DrawContext type exposes the following members.
Methods
Name | Description
FlushBuffer |  Submits geometry for rendering.
GetCamera |  Gets the camera corresponding to the Revit view where rendering takes place.
GetClipPlanes |  Gets the clipping planes for the Revit view where rendering takes place. Clipping planes control the 3D extent of a view and can be set using Section Box in Revit.
GetClipRectangle |  Gets the clip rectangle for the Revit view where rendering takes place. The clip rectangle is the area currently being redrawn, which may be smaller than the view rectangle.
GetOverrideColor |  Returns override color that will be applied to geometry during rendering.
GetOverrideTransparency |  Returns override transparency that will be applied to geometry during rendering.
GetViewRectangle |  Gets the rectangle that represents the extent (in 2D) of the Revit view where rendering takes place.
IsAvailable |  Checks whether the facilities of this class are available for use in the current scope.
IsInterrupted |  Checks whether the current rendering pass has been interrupted.
IsTransparentPass |  Determines whether the current rendering pass is for transparent objects.
SetWorldTransform |  Sets the world transformation that will be applied to geometry during rendering.
Top
See Also
Reference
DrawContext Class
Autodesk.Revit.DB.DirectContext3D Namespace